99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2c/esp32_mquickjs_i2c.c
#include "esp32_mquickjs_i2c.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_I2C

#include "utils/esp32_mquickjs_byte_source.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_peripheral_lease.h"

#include <stdbool.h>
#include <stdint.h>
#include <stdatomic.h>
#include <string.h>

#include "driver/gpio.h"
#include "driver/i2c_master.h"
#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "soc/soc_caps.h"

typedef struct {
    int32_t bus_id;
    uint32_t generation;
} esp32_mquickjs_i2c_bus_ref_t;

typedef struct {
    bool allocated;
    int32_t bus_id;
    uint32_t generation;
    gpio_num_t sda_pin;
    gpio_num_t scl_pin;
    uint32_t freq_hz;
    uint32_t timeout_ms;
    bool internal_pullup;
    bool busy;
    bool release_pending;
    i2c_master_bus_handle_t bus_handle;
    i2c_master_dev_handle_t cached_device_handle;
    uint16_t cached_device_address;
    esp32_mquickjs_peripheral_lease_t lease;
} esp32_mquickjs_i2c_slot_t;

static esp32_mquickjs_i2c_slot_t s_i2c_slots[SOC_I2C_NUM];
static uint32_t s_i2c_next_generation = 1;

static esp_err_t i2c_cleanup_slot(esp32_mquickjs_i2c_slot_t *slot);

static bool js_value_to_gpio_num(JSContext *ctx, JSValue value, gpio_num_t *out_pin)
{
    int pin = -1;

    if (JS_ToInt32(ctx, &pin, value) != 0) {
        return false;
    }
    if (pin < 0 || pin >= GPIO_NUM_MAX || !GPIO_IS_VALID_GPIO(pin)) {
        return false;
    }

    *out_pin = (gpio_num_t)pin;
    return true;
}

static bool js_value_to_u32(JSContext *ctx, JSValue value, uint32_t *out_value)
{
    int raw_value = 0;

    if (JS_ToInt32(ctx, &raw_value, value) != 0 || raw_value < 0) {
        return false;
    }
    *out_value = (uint32_t)raw_value;
    return true;
}

static bool js_value_to_bool(JSContext *ctx, JSValue value, bool *out_value)
{
    int raw_value = 0;

    if (JS_IsBool(value)) {
        *out_value = (value == JS_TRUE);
        return true;
    }
    if (JS_ToInt32(ctx, &raw_value, value) != 0) {
        return false;
    }
    *out_value = raw_value != 0;
    return true;
}

static JSValue i2c_throw_error(JSContext *ctx,
                               esp_err_t err,
                               const char *message)
{
    return JS_ThrowInternalError(ctx, "%s: %s", message, esp_err_to_name(err));
}

static void i2c_init_slot(esp32_mquickjs_i2c_slot_t *slot, int32_t bus_id)
{
    memset(slot, 0, sizeof(*slot));
    slot->bus_id = bus_id;
}

static void i2c_reset_slots(void)
{
    int32_t i;

    for (i = 0; i < (int32_t)SOC_I2C_NUM; ++i) {
        if (!s_i2c_slots[i].allocated) {
            i2c_init_slot(&s_i2c_slots[i], i);
        }
    }
}

static uint32_t i2c_take_generation(void)
{
    uint32_t generation = s_i2c_next_generation++;

    if (generation == 0) {
        generation = s_i2c_next_generation++;
    }
    return generation;
}

static esp32_mquickjs_i2c_slot_t *i2c_alloc_slot(void)
{
    int32_t i;

    for (i = 0; i < (int32_t)SOC_I2C_NUM; ++i) {
        esp32_mquickjs_i2c_slot_t *slot = &s_i2c_slots[i];

        if (slot->allocated && slot->release_pending && !slot->busy) {
            (void)i2c_cleanup_slot(slot);
        }
        if (slot->allocated) {
            continue;
        }
        i2c_init_slot(slot, i);
        if (!esp32_mquickjs_peripheral_lease_acquire(
                ESP32_MQUICKJS_PERIPHERAL_I2C_PORT, i,
                ESP32_MQUICKJS_PERIPHERAL_OWNER_I2C, &slot->lease)) {
            continue;
        }
        slot->allocated = true;
        slot->generation = i2c_take_generation();
        return slot;
    }
    return NULL;
}

static esp_err_t i2c_cleanup_slot(esp32_mquickjs_i2c_slot_t *slot)
{
    int32_t bus_id;
    esp_err_t err;

    if (slot == NULL || !slot->allocated) {
        return ESP_OK;
    }
    if (slot->busy) {
        return ESP_ERR_INVALID_STATE;
    }

    bus_id = slot->bus_id;
    if (slot->cached_device_handle != NULL) {
        err = i2c_master_bus_rm_device(slot->cached_device_handle);
        if (err != ESP_OK) {
            return err;
        }
        slot->cached_device_handle = NULL;
        slot->cached_device_address = 0;
    }
    if (slot->bus_handle != NULL) {
        err = i2c_del_master_bus(slot->bus_handle);
        if (err != ESP_OK) {
            return err;
        }
    }
    esp32_mquickjs_peripheral_lease_release(&slot->lease);
    i2c_init_slot(slot, bus_id);
    return ESP_OK;
}

static esp32_mquickjs_i2c_slot_t *i2c_get_slot(const esp32_mquickjs_i2c_bus_ref_t *ref)
{
    esp32_mquickjs_i2c_slot_t *slot;

    if (ref == NULL || ref->bus_id < 0 || ref->bus_id >= (int32_t)SOC_I2C_NUM) {
        return NULL;
    }

    slot = &s_i2c_slots[ref->bus_id];
    if (!slot->allocated || slot->generation != ref->generation) {
        return NULL;
    }
    return slot;
}

static JSValue i2c_make_status_object(JSContext *ctx, const esp32_mquickjs_i2c_slot_t *slot)
{
    JSGCRef status_ref;
    JSValue *status_obj;

    status_obj = JS_PushGCRef(ctx, &status_ref);
    *status_obj = JS_NewObject(ctx);
    if (JS_IsException(*status_obj)) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    if (!esp32_mquickjs_set_property_ref(ctx, status_obj, "opened",
                                     JS_NewBool(slot != NULL && slot->allocated)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "sda",
                                     JS_NewInt32(ctx, slot != NULL ? (int32_t)slot->sda_pin : ESP32_MQUICKJS_I2C_DEFAULT_SDA_PIN)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "scl",
                                     JS_NewInt32(ctx, slot != NULL ? (int32_t)slot->scl_pin : ESP32_MQUICKJS_I2C_DEFAULT_SCL_PIN)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "freqHz",
                                     JS_NewUint32(ctx, slot != NULL ? slot->freq_hz : ESP32_MQUICKJS_I2C_DEFAULT_FREQ_HZ)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "timeoutMs",
                                     JS_NewUint32(ctx, slot != NULL ? slot->timeout_ms : ESP32_MQUICKJS_I2C_DEFAULT_TIMEOUT_MS)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "internalPullup",
                                     JS_NewBool(slot != NULL ? slot->internal_pullup : ESP32_MQUICKJS_I2C_ENABLE_INTERNAL_PULLUP))) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    return JS_PopGCRef(ctx, &status_ref);
}

static JSValue i2c_make_bus_object(JSContext *ctx, const esp32_mquickjs_i2c_slot_t *slot)
{
    JSGCRef bus_ref;
    JSValue *bus_obj;
    esp32_mquickjs_i2c_bus_ref_t *bus_data;

    bus_obj = JS_PushGCRef(ctx, &bus_ref);
    *bus_obj = JS_NewObjectClassUser(ctx, JS_CLASS_I2C_BUS);
    if (JS_IsException(*bus_obj) || slot == NULL) {
        JS_PopGCRef(ctx, &bus_ref);
        return JS_EXCEPTION;
    }

