99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2c/esp32_mquickjs_i2c.c
    bus_data = heap_caps_malloc(sizeof(*bus_data), MALLOC_CAP_8BIT);
    if (bus_data == NULL) {
        JS_PopGCRef(ctx, &bus_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    bus_data->bus_id = slot->bus_id;
    bus_data->generation = slot->generation;
    JS_SetOpaque(ctx, *bus_obj, bus_data);

    return JS_PopGCRef(ctx, &bus_ref);
}

static int i2c_bus_ref_from_object(JSContext *ctx,
                                   JSValue bus_value,
                                   const char *api_name,
                                   esp32_mquickjs_i2c_bus_ref_t *out_ref)
{
    const esp32_mquickjs_i2c_bus_ref_t *bus_ref;

    if (out_ref == NULL || JS_GetClassID(ctx, bus_value) != JS_CLASS_I2C_BUS) {
        JS_ThrowTypeError(ctx, "%s expects a valid I2CBus instance", api_name);
        return -1;
    }
    bus_ref = JS_GetOpaque(ctx, bus_value);
    if (bus_ref == NULL) {
        JS_ThrowTypeError(ctx, "%s expects a valid I2CBus instance", api_name);
        return -1;
    }
    *out_ref = *bus_ref;
    return 0;
}

static int i2c_get_bound_slot(JSContext *ctx,
                              JSValue bus_value,
                              const char *api_name,
                              esp32_mquickjs_i2c_bus_ref_t *out_ref,
                              esp32_mquickjs_i2c_slot_t **out_slot)
{
    esp32_mquickjs_i2c_slot_t *slot;

    if (i2c_bus_ref_from_object(ctx, bus_value, api_name, out_ref) != 0) {
        return -1;
    }
    slot = i2c_get_slot(out_ref);
    if (slot == NULL) {
        JS_ThrowReferenceError(ctx, "%s failed because the I2C bus is closed", api_name);
        return -1;
    }
    if (out_slot != NULL) {
        *out_slot = slot;
    }
    return 0;
}

static int i2c_get_this_slot(JSContext *ctx,
                             JSValue this_value,
                             const char *api_name,
                             esp32_mquickjs_i2c_bus_ref_t *out_ref,
                             esp32_mquickjs_i2c_slot_t **out_slot)
{
    return i2c_get_bound_slot(ctx, this_value, api_name, out_ref, out_slot);
}

static bool js_value_to_i2c_address(JSContext *ctx, JSValue value, uint16_t *out_address)
{
    uint32_t address = 0;

    if (!js_value_to_u32(ctx, value, &address) || address > 0x7f || address < 0x03) {
        return false;
    }

    *out_address = (uint16_t)address;
    return true;
}

static JSValue js_bytes_to_array(JSContext *ctx, const uint8_t *bytes, size_t length)
{
    JSGCRef array_ref;
    JSValue *array_obj;
    uint32_t i;

    array_obj = JS_PushGCRef(ctx, &array_ref);
    *array_obj = JS_NewArray(ctx, 0);
    if (JS_IsException(*array_obj)) {
        JS_PopGCRef(ctx, &array_ref);
        return JS_EXCEPTION;
    }

    for (i = 0; i < length; ++i) {
        if (JS_IsException(JS_SetPropertyUint32(ctx, *array_obj, i, JS_NewInt32(ctx, bytes[i])))) {
            JS_PopGCRef(ctx, &array_ref);
            return JS_EXCEPTION;
        }
    }

    return JS_PopGCRef(ctx, &array_ref);
}

static esp_err_t i2c_get_cached_device(esp32_mquickjs_i2c_slot_t *slot,
                                       uint16_t address,
                                       i2c_master_dev_handle_t *out_handle)
{
    i2c_device_config_t device_config = {0};
    esp_err_t err;

    if (slot == NULL || !slot->allocated || slot->bus_handle == NULL ||
        out_handle == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    if (slot->cached_device_handle != NULL &&
        slot->cached_device_address == address) {
        *out_handle = slot->cached_device_handle;
        return ESP_OK;
    }
    if (slot->cached_device_handle != NULL) {
        err = i2c_master_bus_rm_device(slot->cached_device_handle);
        if (err != ESP_OK) {
            return err;
        }
        slot->cached_device_handle = NULL;
        slot->cached_device_address = 0;
    }

    device_config.dev_addr_length = I2C_ADDR_BIT_LEN_7;
    device_config.device_address = address;
    device_config.scl_speed_hz = slot->freq_hz;
    device_config.scl_wait_us = slot->timeout_ms * 1000U;
    device_config.flags.disable_ack_check = 0;
    err = i2c_master_bus_add_device(slot->bus_handle, &device_config,
                                    &slot->cached_device_handle);
    if (err != ESP_OK) {
        return err;
    }
    slot->cached_device_address = address;
    *out_handle = slot->cached_device_handle;
    return ESP_OK;
}

static JSValue i2c_make_write_chunks_stats(JSContext *ctx,
                                           uint32_t chunks,
                                           size_t bytes,
                                           uint64_t total_us)
{
    JSGCRef stats_ref;
    JSValue *stats;

    stats = JS_PushGCRef(ctx, &stats_ref);
    *stats = JS_NewObject(ctx);
    if (JS_IsException(*stats)) {
        JS_PopGCRef(ctx, &stats_ref);
        return JS_EXCEPTION;
    }

    if (!esp32_mquickjs_set_property_ref(ctx, stats, "chunks", JS_NewUint32(ctx, chunks)) ||
        !esp32_mquickjs_set_property_ref(ctx, stats, "bytes", JS_NewInt64(ctx, (int64_t)bytes)) ||
        !esp32_mquickjs_set_property_ref(ctx, stats, "totalUs", JS_NewInt64(ctx, (int64_t)total_us))) {
        JS_PopGCRef(ctx, &stats_ref);
        return JS_EXCEPTION;
    }

    return JS_PopGCRef(ctx, &stats_ref);
}

static JSValue i2c_open(JSContext *ctx, int argc, JSValue *argv)
{
    gpio_num_t sda_pin = (gpio_num_t)ESP32_MQUICKJS_I2C_DEFAULT_SDA_PIN;
    gpio_num_t scl_pin = (gpio_num_t)ESP32_MQUICKJS_I2C_DEFAULT_SCL_PIN;
    uint32_t freq_hz = ESP32_MQUICKJS_I2C_DEFAULT_FREQ_HZ;
    uint32_t timeout_ms = ESP32_MQUICKJS_I2C_DEFAULT_TIMEOUT_MS;
    bool internal_pullup = ESP32_MQUICKJS_I2C_ENABLE_INTERNAL_PULLUP;
    i2c_master_bus_config_t bus_config = {0};
    esp32_mquickjs_i2c_slot_t *slot;
    JSValue result;
    esp_err_t err;

    if (argc >= 1 && !JS_IsUndefined(argv[0])) {
        JSGCRef property_ref;
        JSValue *property;

        if (JS_GetClassID(ctx, argv[0]) < 0) {
            return JS_ThrowTypeError(ctx,
                                     "i2c.open(options?) expects an object with sda/scl/freqHz/timeoutMs/internalPullup");
        }

        property = JS_PushGCRef(ctx, &property_ref);

        *property = JS_GetPropertyStr(ctx, argv[0], "sda");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_gpio_num(ctx, *property, &sda_pin)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "i2c.open({ sda }) expects a valid GPIO");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "scl");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_gpio_num(ctx, *property, &scl_pin)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "i2c.open({ scl }) expects a valid GPIO");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "freqHz");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (JS_IsUndefined(*property)) {
            *property = JS_GetPropertyStr(ctx, argv[0], "freq");
            if (JS_IsException(*property)) {
                JS_PopGCRef(ctx, &property_ref);
                return JS_EXCEPTION;
            }
        }
        if (!JS_IsUndefined(*property) &&
            (!js_value_to_u32(ctx, *property, &freq_hz) || freq_hz == 0)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "i2c.open({ freqHz }) expects a positive integer");
        }

