99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2c/esp32_mquickjs_i2c.c
        *property = JS_GetPropertyStr(ctx, argv[0], "timeoutMs");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_u32(ctx, *property, &timeout_ms)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "i2c.open({ timeoutMs }) expects a non-negative integer");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "internalPullup");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_bool(ctx, *property, &internal_pullup)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "i2c.open({ internalPullup }) expects a boolean-like value");
        }
        JS_PopGCRef(ctx, &property_ref);
    }

    if (!GPIO_IS_VALID_GPIO(sda_pin) || !GPIO_IS_VALID_GPIO(scl_pin)) {
        return JS_ThrowTypeError(
            ctx,
            "i2c.open() requires configured default SDA/SCL GPIOs or explicit { sda, scl } overrides");
    }

    slot = i2c_alloc_slot();
    if (slot == NULL) {
        return JS_ThrowInternalError(ctx, "i2c.open() failed: no available I2C bus slots");
    }

    bus_config.i2c_port = (i2c_port_num_t)slot->bus_id;
    bus_config.sda_io_num = sda_pin;
    bus_config.scl_io_num = scl_pin;
    bus_config.clk_source = I2C_CLK_SRC_DEFAULT;
    bus_config.glitch_ignore_cnt = 7;
    bus_config.flags.enable_internal_pullup = internal_pullup ? 1U : 0U;

    err = i2c_new_master_bus(&bus_config, &slot->bus_handle);
    if (err != ESP_OK) {
        i2c_cleanup_slot(slot);
        return i2c_throw_error(ctx, err, "i2c.open() failed");
    }

    slot->sda_pin = sda_pin;
    slot->scl_pin = scl_pin;
    slot->freq_hz = freq_hz;
    slot->timeout_ms = timeout_ms;
    slot->internal_pullup = internal_pullup;

    result = i2c_make_bus_object(ctx, slot);
    if (JS_IsException(result)) {
        slot->release_pending = true;
        (void)i2c_cleanup_slot(slot);
    }
    return result;
}

void esp32_mquickjs_deinit_i2c_runtime(void)
{
    int32_t i;

    for (i = 0; i < (int32_t)SOC_I2C_NUM; ++i) {
        if (s_i2c_slots[i].allocated) {
            s_i2c_slots[i].release_pending = true;
            (void)i2c_cleanup_slot(&s_i2c_slots[i]);
        }
    }
    i2c_reset_slots();
}

static bool i2c_register_future_drivers(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime);

bool esp32_mquickjs_init_i2c_runtime(JSContext *ctx,
                                     esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_deinit_i2c_runtime();
    return i2c_register_future_drivers(ctx, runtime);
}

JSValue js_i2c_bus_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "I2CBus cannot be constructed directly");
}

void js_i2c_bus_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_i2c_bus_ref_t *bus_ref = opaque;
    esp32_mquickjs_i2c_slot_t *slot;

    (void)ctx;

    if (bus_ref == NULL) {
        return;
    }

    slot = i2c_get_slot(bus_ref);
    if (slot != NULL) {
        slot->release_pending = true;
        (void)i2c_cleanup_slot(slot);
    }
    heap_caps_free(bus_ref);
}

JSValue js_i2c_bus_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_i2c_bus_ref_t bus_ref;
    esp32_mquickjs_i2c_bus_ref_t *bus_ref_ptr;
    esp32_mquickjs_i2c_slot_t *slot;
    esp_err_t err;

    (void)argc;
    (void)argv;

    if (i2c_bus_ref_from_object(ctx, *this_val, "I2CBus.close()", &bus_ref) != 0) {
        return JS_EXCEPTION;
    }
    slot = i2c_get_slot(&bus_ref);
    if (slot != NULL) {
        if (slot->busy) {
            return JS_ThrowInternalError(ctx,
                                         "I2CBus.close() refused while an operation is pending");
        }
        err = i2c_cleanup_slot(slot);
        if (err != ESP_OK) {
            return i2c_throw_error(ctx, err, "I2CBus.close() failed");
        }
    }
    bus_ref_ptr = JS_GetOpaque(ctx, *this_val);
    if (bus_ref_ptr != NULL) {
        bus_ref_ptr->bus_id = -1;
        bus_ref_ptr->generation = 0;
    }
    return JS_TRUE;
}

JSValue js_i2c_bus_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_i2c_bus_ref_t bus_ref;
    esp32_mquickjs_i2c_slot_t *slot = NULL;

    (void)argc;
    (void)argv;

    if (i2c_get_this_slot(ctx, *this_val, "I2CBus.status()", &bus_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    return i2c_make_status_object(ctx, slot);
}

typedef enum {
    I2C_FUTURE_SCAN,
    I2C_FUTURE_WRITE,
    I2C_FUTURE_WRITE_CHUNKS,
    I2C_FUTURE_WRITE_SEGMENTS,
    I2C_FUTURE_READ,
    I2C_FUTURE_WRITE_READ,
} i2c_future_kind_t;

struct esp32_mquickjs_future_driver_state {
    i2c_future_kind_t kind;
    JSContext *ctx;
    JSGCRef owner_ref;
    esp32_mquickjs_i2c_bus_ref_t bus_ref;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    uint16_t address;
    uint32_t timeout_ms;
    uint32_t chunk_count;
    uint32_t completed_chunks;
    uint32_t segment_count;
    uint32_t scan_count;
    uint32_t *chunk_lengths;
    i2c_master_transmit_multi_buffer_info_t *segment_buffers;
    uint8_t scan_addresses[0x78 - 0x03];
    uint8_t *write_data;
    size_t write_length;
    uint8_t *read_data;
    size_t read_length;
    uint64_t total_us;
    esp_err_t err;
    _Atomic bool completed;
    bool owner_retained;
    bool started;
    bool cancelled;
};

static void i2c_future_release_owner(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && state->owner_retained) {
        JS_DeleteGCRef(state->ctx, &state->owner_ref);
        state->owner_retained = false;
    }
}

static void i2c_future_release_bus(
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_i2c_slot_t *slot;

    if (state == NULL) {
        return;
    }
    slot = i2c_get_slot(&state->bus_ref);
    if (slot != NULL && state->started) {
        slot->busy = false;
    }
    state->started = false;
    i2c_future_release_owner(state);
}

static void i2c_future_release_prepare_state(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    i2c_future_release_owner(state);
    heap_caps_free(state->chunk_lengths);
    heap_caps_free(state->segment_buffers);
    heap_caps_free(state->write_data);
    heap_caps_free(state->read_data);
    heap_caps_free(state);
}

static esp32_mquickjs_future_driver_state_t *i2c_future_allocate(
    JSContext *ctx,
    JSValue this_value,
    i2c_future_kind_t kind)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_i2c_slot_t *slot = NULL;
    JSValue *owner;

    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return NULL;
    }
    atomic_init(&state->completed, false);
    if (i2c_get_this_slot(ctx,
                          this_value,
                          "I2CBus Future operation",
                          &state->bus_ref,
                          &slot) != 0) {
        heap_caps_free(state);
        return NULL;
    }
    if (slot->busy) {
        heap_caps_free(state);
        JS_ThrowInternalError(ctx, "I2C bus is busy");
        return NULL;
    }
    state->kind = kind;
    state->ctx = ctx;
    state->timeout_ms = slot->timeout_ms;
    owner = JS_AddGCRef(ctx, &state->owner_ref);
    *owner = this_value;
    state->owner_retained = true;
    return state;
}

