99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2c/esp32_mquickjs_i2c.c
static bool i2c_future_copy_bytes(JSContext *ctx,
                                  JSValue value,
                                  const char *api_name,
                                  uint8_t **out_data,
                                  size_t *out_length)
{
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue error = JS_UNDEFINED;
    uint8_t *copy = NULL;

    if (!esp32_mquickjs_get_byte_source(ctx,
                                       value,
                                       api_name,
                                       &source,
                                       &owned,
                                       &error)) {
        if (JS_IsUndefined(error)) {
            JS_ThrowTypeError(ctx, "%s expects byte data", api_name);
        } else if (!JS_IsException(error)) {
            (void)JS_Throw(ctx, error);
        }
        return false;
    }
    if (source.length > 0) {
        copy = heap_caps_malloc(source.length, MALLOC_CAP_8BIT);
        if (copy == NULL) {
            esp32_mquickjs_release_byte_source(owned);
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        memcpy(copy, source.data, source.length);
    }
    *out_data = copy;
    *out_length = source.length;
    esp32_mquickjs_release_byte_source(owned);
    return true;
}

static bool i2c_scan_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    (void)argv;
    if (out_state == NULL || argc != 0) {
        JS_ThrowTypeError(ctx, "I2CBus.scan() expects no arguments");
        return false;
    }
    *out_state = i2c_future_allocate(ctx, this_ref->val, I2C_FUTURE_SCAN);
    return *out_state != NULL;
}

static bool i2c_write_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;

    if (out_state == NULL || argc != 2 ||
        !js_value_to_i2c_address(ctx, argv[0].val, &(uint16_t){0})) {
        JS_ThrowTypeError(ctx,
                          "I2CBus.write(addr, data) expects a 7-bit address and byte data");
        return false;
    }
    state = i2c_future_allocate(ctx, this_ref->val, I2C_FUTURE_WRITE);
    if (state == NULL) {
        return false;
    }
    (void)js_value_to_i2c_address(ctx, argv[0].val, &state->address);
    if (!i2c_future_copy_bytes(ctx, argv[1].val, "I2CBus.write(addr, data)",
                               &state->write_data, &state->write_length)) {
        i2c_future_release_prepare_state(state);
        return false;
    }
    *out_state = state;
    return true;
}

static bool i2c_write_sources_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    i2c_future_kind_t kind,
    const char *api_name,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    JSValue error = JS_UNDEFINED;
    uint32_t index;
    size_t total = 0;

    if (out_state == NULL || argc != 2 ||
        !js_value_to_i2c_address(ctx, argv[0].val, &(uint16_t){0})) {
        JS_ThrowTypeError(ctx, "%s expects a 7-bit address and byte-source chunks",
                          api_name);
        return false;
    }
    state = i2c_future_allocate(ctx, this_ref->val, kind);
    if (state == NULL) {
        return false;
    }
    (void)js_value_to_i2c_address(ctx, argv[0].val, &state->address);
    if (!esp32_mquickjs_get_byte_source_array_length(
            ctx, argv[1].val, api_name,
            &state->chunk_count, &error)) {
        if (JS_IsUndefined(error)) {
            JS_ThrowTypeError(ctx, "%s expects an array-like object", api_name);
        }
        i2c_future_release_prepare_state(state);
        return false;
    }
    if (state->chunk_count > 0) {
        state->chunk_lengths = heap_caps_calloc(state->chunk_count,
                                                sizeof(*state->chunk_lengths),
                                                MALLOC_CAP_8BIT);
        if (state->chunk_lengths == NULL) {
            i2c_future_release_prepare_state(state);
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
    }
    for (index = 0; index < state->chunk_count; ++index) {
        esp32_mquickjs_byte_source_chunk_t chunk;
        uint8_t *grown;

        if (!esp32_mquickjs_get_byte_source_chunk(
                ctx, argv[1].val, index, api_name,
                &chunk, &error)) {
            i2c_future_release_prepare_state(state);
            return false;
        }
        if (chunk.source.length > SIZE_MAX - total) {
            esp32_mquickjs_release_byte_source_chunk(ctx, &chunk);
            i2c_future_release_prepare_state(state);
            JS_ThrowRangeError(ctx, "%s byte length overflow", api_name);
            return false;
        }
        state->chunk_lengths[index] = (uint32_t)chunk.source.length;
        if (chunk.source.length > 0) {
            grown = heap_caps_realloc(state->write_data,
                                      total + chunk.source.length,
                                      MALLOC_CAP_8BIT);
            if (grown == NULL) {
                esp32_mquickjs_release_byte_source_chunk(ctx, &chunk);
                i2c_future_release_prepare_state(state);
                JS_ThrowOutOfMemory(ctx);
                return false;
            }
            state->write_data = grown;
            memcpy(state->write_data + total,
                   chunk.source.data,
                   chunk.source.length);
            total += chunk.source.length;
        }
        esp32_mquickjs_release_byte_source_chunk(ctx, &chunk);
    }
    state->write_length = total;
    if (kind == I2C_FUTURE_WRITE_SEGMENTS && state->chunk_count > 0) {
        size_t offset = 0;

        state->segment_buffers = heap_caps_calloc(
            state->chunk_count, sizeof(*state->segment_buffers), MALLOC_CAP_8BIT);
        if (state->segment_buffers == NULL) {
            i2c_future_release_prepare_state(state);
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        for (index = 0; index < state->chunk_count; ++index) {
            uint32_t length = state->chunk_lengths[index];

            if (length > 0) {
                state->segment_buffers[state->segment_count].write_buffer =
                    state->write_data + offset;
                state->segment_buffers[state->segment_count].buffer_size = length;
                ++state->segment_count;
            }
            offset += length;
        }
    }
    *out_state = state;
    return true;
}

static bool i2c_write_chunks_future_prepare(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    return i2c_write_sources_future_prepare(
        ctx, this_ref, argc, argv, I2C_FUTURE_WRITE_CHUNKS,
        "I2CBus.writeChunks(addr, chunks)", out_state);
}

static bool i2c_write_segments_future_prepare(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    return i2c_write_sources_future_prepare(
        ctx, this_ref, argc, argv, I2C_FUTURE_WRITE_SEGMENTS,
        "I2CBus.writeSegments(addr, segments)", out_state);
}

static bool i2c_read_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    uint32_t read_length;

    if (out_state == NULL || argc != 2 ||
        !js_value_to_i2c_address(ctx, argv[0].val, &(uint16_t){0}) ||
        !js_value_to_u32(ctx, argv[1].val, &read_length)) {
        JS_ThrowTypeError(ctx,
                          "I2CBus.read(addr, length) expects a 7-bit address and byte length");
        return false;
    }
    state = i2c_future_allocate(ctx, this_ref->val, I2C_FUTURE_READ);
    if (state == NULL) {
        return false;
    }
    (void)js_value_to_i2c_address(ctx, argv[0].val, &state->address);
    state->read_length = read_length;
    if (read_length > 0) {
        state->read_data = heap_caps_malloc(read_length, MALLOC_CAP_8BIT);
        if (state->read_data == NULL) {
            i2c_future_release_prepare_state(state);
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
    }
    *out_state = state;
    return true;
}

static bool i2c_write_read_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    uint32_t read_length;

    if (out_state == NULL || argc != 3 ||
        !js_value_to_i2c_address(ctx, argv[0].val, &(uint16_t){0}) ||
        !js_value_to_u32(ctx, argv[2].val, &read_length)) {
        JS_ThrowTypeError(ctx,
                          "I2CBus.writeRead(addr, writeData, readLength) expects a 7-bit address, write bytes, and read length");
        return false;
    }
    state = i2c_future_allocate(ctx, this_ref->val, I2C_FUTURE_WRITE_READ);
    if (state == NULL) {
        return false;
    }
    (void)js_value_to_i2c_address(ctx, argv[0].val, &state->address);
    if (!i2c_future_copy_bytes(ctx, argv[1].val,
                               "I2CBus.writeRead(addr, writeData, readLength)",
                               &state->write_data, &state->write_length)) {
        i2c_future_release_prepare_state(state);
        return false;
    }
    state->read_length = read_length;
    if (read_length > 0) {
        state->read_data = heap_caps_malloc(read_length, MALLOC_CAP_8BIT);
        if (state->read_data == NULL) {
            i2c_future_release_prepare_state(state);
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
    }
    *out_state = state;
    return true;
}

