99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2c/esp32_mquickjs_i2c.c
static void i2c_future_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    esp32_mquickjs_i2c_slot_t *slot = i2c_get_slot(&state->bus_ref);
    i2c_master_dev_handle_t device = NULL;
    int64_t started_us = esp_timer_get_time();

    if (slot == NULL) {
        state->err = ESP_ERR_INVALID_STATE;
        atomic_store_explicit(&state->completed, true, memory_order_release);
        return;
    }
    if (state->kind == I2C_FUTURE_SCAN) {
        uint16_t address;

        for (address = 0x03; address <= 0x77; ++address) {
            esp_err_t err = i2c_master_probe(slot->bus_handle,
                                             address,
                                             (int)state->timeout_ms);
            if (err == ESP_OK) {
                state->scan_addresses[state->scan_count++] = (uint8_t)address;
            } else if (err != ESP_ERR_NOT_FOUND && err != ESP_ERR_INVALID_RESPONSE) {
                state->err = err;
                break;
            }
        }
        state->total_us = (uint64_t)(esp_timer_get_time() - started_us);
        atomic_store_explicit(&state->completed, true, memory_order_release);
        return;
    }
    state->err = i2c_get_cached_device(slot, state->address, &device);
    if (state->err != ESP_OK) {
        atomic_store_explicit(&state->completed, true, memory_order_release);
        return;
    }
    if (state->kind == I2C_FUTURE_WRITE) {
        state->err = i2c_master_transmit(device,
                                         state->write_data,
                                         state->write_length,
                                         (int)state->timeout_ms);
    } else if (state->kind == I2C_FUTURE_WRITE_CHUNKS) {
        uint32_t index;
        size_t offset = 0;

        for (index = 0; index < state->chunk_count; ++index) {
            uint32_t length = state->chunk_lengths[index];

            if (length == 0) {
                continue;
            }
            state->err = i2c_master_transmit(device,
                                             state->write_data + offset,
                                             length,
                                             (int)state->timeout_ms);
            if (state->err != ESP_OK) {
                break;
            }
            state->completed_chunks++;
            offset += length;
        }
    } else if (state->kind == I2C_FUTURE_WRITE_SEGMENTS) {
        state->err = state->segment_count == 0
                         ? ESP_OK
                         : i2c_master_multi_buffer_transmit(
                               device, state->segment_buffers,
                               state->segment_count, (int)state->timeout_ms);
        if (state->err == ESP_OK) {
            state->completed_chunks = state->segment_count;
        }
    } else if (state->kind == I2C_FUTURE_READ) {
        state->err = i2c_master_receive(device,
                                        state->read_data,
                                        state->read_length,
                                        (int)state->timeout_ms);
    } else {
        state->err = i2c_master_transmit_receive(device,
                                                 state->write_data,
                                                 state->write_length,
                                                 state->read_data,
                                                 state->read_length,
                                                 (int)state->timeout_ms);
    }
    state->total_us = (uint64_t)(esp_timer_get_time() - started_us);
    atomic_store_explicit(&state->completed, true, memory_order_release);
}

static bool i2c_future_start(JSContext *ctx,
                             esp32_mquickjs_runtime_t *runtime,
                             esp32_mquickjs_future_token_t token,
                             esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_i2c_slot_t *slot = state != NULL
        ? i2c_get_slot(&state->bus_ref) : NULL;

    if (state == NULL || slot == NULL) {
        JS_ThrowReferenceError(ctx, "I2C bus closed before operation start");
        return false;
    }
    if (slot->busy) {
        JS_ThrowInternalError(ctx, "I2C bus is busy");
        return false;
    }
    slot->busy = true;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (!esp32_mquickjs_future_submit_worker(runtime, token,
                                             i2c_future_worker, state)) {
        JS_ThrowInternalError(ctx, "I2C Future worker queue is busy");
        return false;
    }
    return true;
}

static esp32_mquickjs_future_poll_t i2c_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL && atomic_load_explicit(
                                &state->completed, memory_order_acquire)
        ? ESP32_MQUICKJS_FUTURE_READY
        : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue i2c_future_finish(JSContext *ctx,
                                 esp32_mquickjs_future_driver_state_t *state)
{
    i2c_future_release_bus(state);
    if (state == NULL || state->cancelled) {
        return JS_ThrowInternalError(ctx, "I2C operation cancelled");
    }
    if (state->err != ESP_OK) {
        return i2c_throw_error(ctx, state->err, "I2CBus operation failed");
    }
    if (state->kind == I2C_FUTURE_SCAN) {
        JSGCRef array_ref;
        JSValue *array = JS_PushGCRef(ctx, &array_ref);
        uint32_t index;

        *array = JS_NewArray(ctx, state->scan_count);
        for (index = 0; !JS_IsException(*array) && index < state->scan_count; ++index) {
            if (JS_IsException(JS_SetPropertyUint32(
                    ctx, *array, index, JS_NewInt32(ctx, state->scan_addresses[index])))) {
                JS_PopGCRef(ctx, &array_ref);
                return JS_EXCEPTION;
            }
        }
        return JS_PopGCRef(ctx, &array_ref);
    }
    if (state->kind == I2C_FUTURE_WRITE) {
        return JS_NewInt32(ctx, (int32_t)state->write_length);
    }
    if (state->kind == I2C_FUTURE_WRITE_CHUNKS ||
        state->kind == I2C_FUTURE_WRITE_SEGMENTS) {
        return i2c_make_write_chunks_stats(ctx,
                                           state->completed_chunks,
                                           state->write_length,
                                           state->total_us);
    }
    return js_bytes_to_array(ctx, state->read_data, state->read_length);
}

static esp32_mquickjs_cancel_result_t i2c_future_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL ||
        atomic_load_explicit(&state->completed, memory_order_acquire) ||
        state->cancelled) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    state->cancelled = true;
    return ESP32_MQUICKJS_CANCEL_REQUESTED;
}

