99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2c/esp32_mquickjs_i2c.c
static void i2c_future_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    i2c_future_release_bus(state);
    i2c_future_release_prepare_state(state);
}

static uint32_t i2c_future_timeout_ms(
    const esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL ? state->timeout_ms : 0;
}

#define I2C_FUTURE_DRIVER(name, prepare_fn) \
    static const esp32_mquickjs_future_driver_t name = { \
        .capture = prepare_fn, \
        .start = i2c_future_start, \
        .poll = i2c_future_poll, \
        .finish = i2c_future_finish, \
        .cancel = i2c_future_cancel, \
        .destroy = i2c_future_destroy, \
        .timeout_ms = i2c_future_timeout_ms, \
    }

I2C_FUTURE_DRIVER(s_i2c_scan_driver, i2c_scan_future_prepare);
I2C_FUTURE_DRIVER(s_i2c_write_driver, i2c_write_future_prepare);
I2C_FUTURE_DRIVER(s_i2c_write_chunks_driver, i2c_write_chunks_future_prepare);
I2C_FUTURE_DRIVER(s_i2c_write_segments_driver, i2c_write_segments_future_prepare);
I2C_FUTURE_DRIVER(s_i2c_read_driver, i2c_read_future_prepare);
I2C_FUTURE_DRIVER(s_i2c_write_read_driver, i2c_write_read_future_prepare);

#undef I2C_FUTURE_DRIVER

static JSValue i2c_future_call_and_wait(JSContext *ctx,
                                        JSValue receiver,
                                        const char *method_name,
                                        int argc,
                                        JSValue *argv)
{
    JSGCRef receiver_ref;
    JSGCRef method_ref;
    JSValue *rooted_receiver = JS_PushGCRef(ctx, &receiver_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *rooted_receiver = receiver;
    *method = JS_GetPropertyStr(ctx, *rooted_receiver, method_name);
    result = JS_IsException(*method)
        ? JS_EXCEPTION
        : esp32_mquickjs_future_call_and_wait(ctx,
                                              esp32_mquickjs_get_active_runtime(),
                                              *method,
                                              *rooted_receiver,
                                              argc,
                                              argv);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    return result;
}

static bool i2c_register_future_drivers(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime)
{
    static const char *names[] = {
        "scan", "write", "writeChunks", "writeSegments", "read", "writeRead"
    };
    static const esp32_mquickjs_future_driver_t *drivers[] = {
        &s_i2c_scan_driver,
        &s_i2c_write_driver,
        &s_i2c_write_chunks_driver,
        &s_i2c_write_segments_driver,
        &s_i2c_read_driver,
        &s_i2c_write_read_driver,
    };
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    size_t index;
    bool result = true;

    *object = JS_NewObjectClassUser(ctx, JS_CLASS_I2C_BUS);
    for (index = 0; result && index < sizeof(names) / sizeof(names[0]); ++index) {
        JSGCRef method_ref;
        JSValue *method = JS_PushGCRef(ctx, &method_ref);

        *method = JS_IsException(*object)
            ? JS_EXCEPTION
            : JS_GetPropertyStr(ctx, *object, names[index]);
        result = !JS_IsException(*method) &&
                 esp32_mquickjs_future_register_driver(ctx, runtime,
                                                       *method, drivers[index]);
        JS_PopGCRef(ctx, &method_ref);
    }
    if (!result && !JS_IsException(*object)) {
        JS_ThrowInternalError(ctx, "failed to register I2C Future drivers");
    }
    JS_PopGCRef(ctx, &object_ref);
    return result;
}

JSValue js_i2c_bus_scan(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return i2c_future_call_and_wait(ctx, *this_val, "scan", argc, argv);
}

JSValue js_i2c_bus_write(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return i2c_future_call_and_wait(ctx, *this_val, "write", argc, argv);
}

JSValue js_i2c_bus_write_chunks(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return i2c_future_call_and_wait(ctx, *this_val, "writeChunks", argc, argv);
}

JSValue js_i2c_bus_write_segments(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    return i2c_future_call_and_wait(ctx, *this_val, "writeSegments", argc, argv);
}

JSValue js_i2c_bus_read(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return i2c_future_call_and_wait(ctx, *this_val, "read", argc, argv);
}

JSValue js_i2c_bus_writeRead(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return i2c_future_call_and_wait(ctx, *this_val, "writeRead", argc, argv);
}

JSValue js_i2c_open(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return i2c_open(ctx, argc, argv);
}

JSValue js_i2c_get_default_sda(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, ESP32_MQUICKJS_I2C_DEFAULT_SDA_PIN);
}

JSValue js_i2c_get_default_scl(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, ESP32_MQUICKJS_I2C_DEFAULT_SCL_PIN);
}

JSValue js_i2c_get_default_freq_hz(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewUint32(ctx, ESP32_MQUICKJS_I2C_DEFAULT_FREQ_HZ);
}

JSValue js_i2c_get_default_timeout_ms(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewUint32(ctx, ESP32_MQUICKJS_I2C_DEFAULT_TIMEOUT_MS);
}

#endif
